5-Sequence_Models/Week01/rnn.org
#+TITLE: Recurrent Neural Networks
#+AUTHOR: Mohamed Saleh A. Abdelgadir
#+EMAIL: mohamed.saleh16@gmail.com
#+OPTIONS: H:2 num:nil toc:nil \n:nil @:t ::t |:t ^:{} _:{} *:t TeX:t LaTeX:t


** Why Sequence models
*** Examples of sequence data
   | Problem                    | X                                       | Y                                        |
   |----------------------------+-----------------------------------------+------------------------------------------|
   | Speech Recognition         | speech audio file                       | the text of the speech in the audio file |
   |----------------------------+-----------------------------------------+------------------------------------------|
   | Music Generation           | {}                                      | Music file                               |
   |----------------------------+-----------------------------------------+------------------------------------------|
   | Sentiment Classification   | "This is nothing to like in this movie" | How many stars to give                   |
   |----------------------------+-----------------------------------------+------------------------------------------|
   | DNA sequence analysis      | AGCCCCTGTGAGGAACTAG                     | AG =CCCCTGTGAGGAACT= AG                  |
   |----------------------------+-----------------------------------------+------------------------------------------|
   | Machine Translation        | Voulez-vous chanter avec moi?           | Do you want to sing with me?             |
   |----------------------------+-----------------------------------------+------------------------------------------|
   | Video Activity Recognition | A video of a person running             | Running                                  |
   |----------------------------+-----------------------------------------+------------------------------------------|
   | Name entity recognition    | Yesterday, Zoro met Luffy               | Yesterday, =Zoro= met =Luffy=            |



** Notation
** Recurrent Neural Network Model
** Backpropagation through time
** Different types of RNNs
** Language model and sequence generation 
** Simple novel squence
** Vanishing gradients with RNNs
** Gated Recurrent Unit (GRU)
** Long Short Term Memory (LSTM)
** Bidirectional RNN
** Deep RNNs
