5-Sequence_Models/Week01/rnn.html
<!doctype html>
<html lang="en">
<head>
<title>Recurrent Neural Networks</title>
<!-- 2018-02-21 Wed 11:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Mohamed Saleh A. Abdelgadir">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-12"><h1 class="title">Recurrent Neural Networks</h1>


<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Why Sequence models</h2>
<div class="outline-text-2" id="text-">
</div><div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Examples of sequence data</h3>
<div class="outline-text-3" id="text-">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Problem</th>
<th scope="col" class="text-left">X</th>
<th scope="col" class="text-left">Y</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Speech Recognition</td>
<td class="text-left">speech audio file</td>
<td class="text-left">the text of the speech in the audio file</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="text-left">Music Generation</td>
<td class="text-left">{}</td>
<td class="text-left">Music file</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="text-left">Sentiment Classification</td>
<td class="text-left">"This is nothing to like in this movie"</td>
<td class="text-left">How many stars to give</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="text-left">DNA sequence analysis</td>
<td class="text-left">AGCCCCTGTGAGGAACTAG</td>
<td class="text-left">AG <code>CCCCTGTGAGGAACT</code> AG</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="text-left">Machine Translation</td>
<td class="text-left">Voulez-vous chanter avec moi?</td>
<td class="text-left">Do you want to sing with me?</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="text-left">Video Activity Recognition</td>
<td class="text-left">A video of a person running</td>
<td class="text-left">Running</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="text-left">Name entity recognition</td>
<td class="text-left">Yesterday, Zoro met Luffy</td>
<td class="text-left">Yesterday, <code>Zoro</code> met <code>Luffy</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>



<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Notation</h2>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Recurrent Neural Network Model</h2>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Backpropagation through time</h2>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Different types of RNNs</h2>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Language model and sequence generation</h2>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Simple novel squence</h2>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Vanishing gradients with RNNs</h2>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Gated Recurrent Unit (GRU)</h2>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Long Short Term Memory (LSTM)</h2>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Bidirectional RNN</h2>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Deep RNNs</h2>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Mohamed Saleh A. Abdelgadir</p>
<p class="date">Created: 2018-02-21 Wed 11:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.6)</p>
</div>
</footer>
</body>
</html>